Step 1. Import the necessary libraries

In [176]:
import pandas as pd
import numpy as np

Step 2. Import the dataset and assign it to a variable called users.

In [177]:
users = pd.read_excel("C:/Users/alan/AI Project/occupation.xlsx")

In [178]:
users

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator     2215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

Step 3. Discover what is the mean age per occupation

In [179]:
users.groupby('occupation').age.mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

Step 4. Discover the Male ratio per occupation and sort it from the most to the least

In [180]:
myData = users[users.gender == 'M']
maleData = myData.groupby('occupation')['gender'].count()
totalData = users.groupby('occupation')['gender'].count()
ratio = maleData/totalData
# we will get ratio by divide.
# then we use sort function
sortedData = ratio.sort_values(ascending=False)

In [181]:
# print out sortedData
sortedData

occupation
doctor           1.000000
engineer         0.970149
technician       0.962963
retired          0.928571
programmer       0.909091
executive        0.906250
scientist        0.903226
entertainment    0.888889
lawyer           0.833333
salesman         0.750000
educator         0.726316
student          0.693878
other            0.657143
marketing        0.615385
writer           0.577778
none             0.555556
administrator    0.544304
artist           0.535714
librarian        0.431373
healthcare       0.312500
homemaker        0.142857
Name: gender, dtype: float64

Step 5. For each occupation, calculate the minimum and maximum ages

In [182]:
# groupby to group occupation then use .age to list all the age
# then use min() function to find min
users.groupby('occupation').age.min()

occupation
administrator    21
artist           19
doctor           28
educator         23
engineer         22
entertainment    15
executive        22
healthcare       22
homemaker        20
lawyer           21
librarian        23
marketing        24
none             11
other            13
programmer       20
retired          51
salesman         18
scientist        23
student           7
technician       21
writer           18
Name: age, dtype: int64

In [183]:
# use max() to find max
users.groupby('occupation').age.max()

occupation
administrator    70
artist           48
doctor           64
educator         63
engineer         70
entertainment    50
executive        69
healthcare       62
homemaker        50
lawyer           53
librarian        69
marketing        55
none             55
other            64
programmer       63
retired          73
salesman         66
scientist        55
student          42
technician       55
writer           60
Name: age, dtype: int64

Step 6. For each combination of occupation and gender, calculate the mean age

In [184]:
users.groupby(['occupation','gender']).age.mean()

occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
engineer       F         29.500000
               M         36.600000
entertainment  F         31.000000
               M         29.000000
executive      F         44.000000
               M         38.172414
healthcare     F         39.818182
               M         45.400000
homemaker      F         34.166667
               M         23.000000
lawyer         F         39.500000
               M         36.200000
librarian      F         40.000000
               M         40.000000
marketing      F         37.200000
               M         37.875000
none           F         36.500000
               M         18.600000
other          F         35.472222
               M         34.028986
programmer     F         32.166667
               M         33.216667
retired        F         70.000000
               M         62.538462
salesman       F         27.000000
               M         38.555556
scientist      F         28.333333
               M         36.321429
student        F         20.750000
               M         22.669118
technician     F         38.000000
               M         32.961538
writer         F         37.631579
               M         35.346154
Name: age, dtype: float64

In [185]:
# use filter to filter out male data
myMaleData = users[users.gender == 'M']

In [186]:
# then use groupby, age and mean function
myMaleData.groupby('occupation').age.mean()

occupation
administrator    37.162791
artist           32.333333
doctor           43.571429
educator         43.101449
engineer         36.600000
entertainment    29.000000
executive        38.172414
healthcare       45.400000
homemaker        23.000000
lawyer           36.200000
librarian        40.000000
marketing        37.875000
none             18.600000
other            34.028986
programmer       33.216667
retired          62.538462
salesman         38.555556
scientist        36.321429
student          22.669118
technician       32.961538
writer           35.346154
Name: age, dtype: float64

In [187]:
# use filter to filter out female data
myFemaleData = users[users.gender == 'F']

In [188]:
myFemaleData.groupby('occupation').age.mean()

occupation
administrator    40.638889
artist           30.307692
educator         39.115385
engineer         29.500000
entertainment    31.000000
executive        44.000000
healthcare       39.818182
homemaker        34.166667
lawyer           39.500000
librarian        40.000000
marketing        37.200000
none             36.500000
other            35.472222
programmer       32.166667
retired          70.000000
salesman         27.000000
scientist        28.333333
student          20.750000
technician       38.000000
writer           37.631579
Name: age, dtype: float64

Step 7. For each occupation present the percentage of women and men

In [189]:
users

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator     2215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

In [190]:
users.groupby(['occupation','gender']).age.count()/users.groupby(['occupation']).age.count()

occupation     gender
administrator  F         0.455696
               M         0.544304
artist         F         0.464286
               M         0.535714
doctor         M         1.000000
educator       F         0.273684
               M         0.726316
engineer       F         0.029851
               M         0.970149
entertainment  F         0.111111
               M         0.888889
executive      F         0.093750
               M         0.906250
healthcare     F         0.687500
               M         0.312500
homemaker      F         0.857143
               M         0.142857
lawyer         F         0.166667
               M         0.833333
librarian      F         0.568627
               M         0.431373
marketing      F         0.384615
               M         0.615385
none           F         0.444444
               M         0.555556
other          F         0.342857
               M         0.657143
programmer     F         0.090909
               M         0.909091
retired        F         0.071429
               M         0.928571
salesman       F         0.250000
               M         0.750000
scientist      F         0.096774
               M         0.903226
student        F         0.306122
               M         0.693878
technician     F         0.037037
               M         0.962963
writer         F         0.422222
               M         0.577778
Name: age, dtype: float64